{
    "about": {
        "title": ": : ABOUT ME : :",
        "topics": [
            "Full Stack Software Developer with extensive experience in various programming languages;",
            "Holds a degree in Systems Analysis and Development and in Architecture and Urbanism;",
            "Passionate about creating solutions that positively impact people's lives, always seeking new challenges."
        ],
        "moreButton": "Learn more...",
        "whoIAm": {
            "title": ": : WHO I AM : :",
            "body": [
                "Any attempt to pinpoint when my passion for technology began would be, at the very least, inaccurate. I only remember being very curious about how things worked, but never to the point of destroying my toys to find out. I think I preferred to keep the magic and the dream of one day also being able to build things, like those incredible friction cars I collected.",
                "In school, I was only motivated by assignments that challenged me, from any subject, although math was the most interesting, without a doubt. But it was in 1994 that everything started to take shape. That was the year my father, an entrepreneur in the aviation sector, was awarded at a state conference and brought home a Compaq Presario 486 DX2-66 microcomputer with an -incredible- multimedia kit and an 80Mb hard drive (that's right, not gigabytes).",
                "At that time, without internet at home, activities on the computer were quite limited. All I could do was the old endeavor of 'discovering how it worked,' and for that, it took many magazines and books, being the only way to learn at the time until a computer school opened near the neighborhood. From then on, there were many courses, such as Word, Excel, PowerPoint, Corel Draw, Windows, and others that I don't remember.",
                "I think everything started to get serious when, still in the same decade, I took the Hardware course - Assembly and Maintenance of Microcomputers, and then Programming with Clipper, discovering my special appreciation for software development.",
                "Clipper was already an obsolete language and it didn't make much sense to me to develop anything on that black screen without a mouse. The 'hype' was Delphi, and there I went at 14 or 15 years old to dive into the codes. From then on, operating systems, the internet, the Y2K bug, network security, protocols, Linux, etc., became my great interest.",
                "Years later, specifically in 2004, I moved to the United States and there, I had the opportunity to do some freelance work. Among them, I highlight the cleaning and maintenance of a small supermarket's database, the development of a little program that calculated something I don't remember for this same supermarket, and an institutional website for a construction company.",
                "However, getting to know other cultures and languages awakened in me the desire to know 'how cities and society work as a whole.' So, back in Brazil at the age of 28, I decided to embark on university in the course of Architecture and Urbanism, but the interest in logic and codes never left me; it was only temporarily overshadowed.",
                "In 2020, having graduated as an architect and with a recently signed service contract with Caixa Econômica Federal, I needed to manage my workflow and tried several tools. The combination of Trello + Excel Spreadsheet was the closest to what I wanted, but I still wasn't satisfied. I believed that custom software was what I needed (or maybe I was just fooling myself and looking for a reason) and then I decided to explore what was 'out there' in terms of programming languages.",
                "JavaScript, Java, Python, Ruby, the old Delphi and....wait... C#, .NET, and Visual Studio? I remember their emergence, but at the time, I was quite satisfied with what Delphi was delivering to me. It doesn't hurt to try, right? Wrong! Little did I know that this contact would shake my initial plans and be responsible for my decision to change careers and 're-fall in love' with code, after all, the learning curve of .NET with Windows Forms for a rusty Delphi programmer like me was quite smooth and intuitive.",
                "Done! My first software in C# with Windows Forms (named Fluxus) was born, and with it, my interest in everything new in technology (at least new to me). Git, GitHub, GitLab, Docker, API, MySQL, ORMs, and so many new things to explore. And so it was in 2021 and 2022: one course after another. Udemy, Alura, Balta, Dio became my new Netflix.",
                "The big step was at the end of 2022 when I decided to return to classrooms, but now remote ones in the Analysis and Systems Development course, and since then, I can't have any other focus besides fully migrating to what has always been my first option.",
                "I am grateful to Architecture because it was responsible for making me see more attentively the relationship between function and aesthetics, dream and reality, and knowing that it is always possible to develop anything within space-time or budget limitations without compromising quality.",
                "Today, I recognize in the titles 'Architect' and 'Developer' much more than professions, they are traits of who I am!"
            ],
            "continueButton": "Continue..."
        }
    },
    "technologies": {
        "title": ": : MAIN TECHNOLOGIES : :"
    },
    "certificates": {
        "title": ": : CERTIFICATIONS : :",
        "certificate1": {
            "title": "Certificate in Web 2.0 Development and Design",
            "institution": "FIAP - Faculdade de Informática e Administração Paulista",
            "date": "December 18, 2023"
        },
        "certificate2": {
            "title": "Certificate in System Analysis and Web Prototyping",
            "institution": "FIAP - Faculdade de Informática e Administração Paulista",
            "date": "July 03, 2023"
        },
        "courses": "More than 500 hours of certified courses in programming, databases, and related areas completed through various platforms."
    },
    "courses": {
        "title": ": : COURSES : :",
        "courses": [
            {
                "alura-formation-winforms": {
                    "title": "Windows Forms with C#",
                    "subtitle": "Alura Formation - 7 courses - 86 hours",
                    "subjects": [
                        "Access to SQL Server database;",
                        "Handling customer data;",
                        "Persisting data in the database;",
                        "Forms, components, and events;",
                        "Menus, other forms, and validation with login and password;",
                        "Toolbar, working with classes and JSON;",
                        "Mouse events and more components."
                    ]
                }
            },
            {
                "alura-formation-agile": {
                    "title": "Digital & Agile Thinking",
                    "subtitle": "Alura Formation - 7 courses - 65 hours",
                    "subjects": [
                        "Agility: promoting agile transformation;",
                        "The Agile Company: introducing Business Agility in organizations;",
                        "Scrum: agility in your project;",
                        "Kanban: analyses for implementation;",
                        "Kanban: enhance your deliveries with metrics;",
                        "Advanced Agile: create models and discover Nexus;",
                        "Management 3.0: manage the environment, not the people."
                    ]
                }
            },
            {
                "alura-formation-csharpoop": {
                    "title": "C# and Object-Oriented Programming",
                    "subtitle": "Alura Formation - 4 courses - 39 hours",
                    "subjects": [
                        "C#: exploring the language;",
                        "C#: object-oriented programming;",
                        "C#: using inheritance and implementing interfaces;",
                        "C#: understanding exceptions."
                    ]
                }
            },
            {
                "alura-formation-htmlfromscratch": {
                    "title": "From Scratch: HTML and CSS for Web Projects",
                    "subtitle": "Alura Formation - 6 courses - 51 hours",
                    "subjects": [
                        "HTML and CSS: development environments, file structure, and tags;",
                        "HTML and CSS: Classes, positioning, and Flexbox;",
                        "HTML and CSS: header, footer, and CSS variables;",
                        "HTML and CSS: working with responsiveness and project publishing;",
                        "HTML and CSS: practicing HTML/CSS;",
                        "HTML and CSS: mobile-first responsiveness."
                    ]
                }
            },
            {
                "alura-formation-css": {
                    "title": "CSS: Deep Dive into Styles",
                    "subtitle": "Alura Formation - 5 courses - 36 hours",
                    "subjects": [
                        "CSS: Flexbox and responsive layouts;",
                        "CSS: building layouts with Grid;",
                        "SASS: syntactically awesome CSS;",
                        "Tailwind CSS: styling your page with utility classes;",
                        "Practicing CSS: Grid and Flexbox."
                    ]
                }
            },
            {
                "balta-carrer-fundamentals": {
                    "title": ".NET Developer Fundamentals",
                    "subtitle": "balta.io Career - 2 courses",
                    "subjects": [
                        "C# Fundamentals;",
                        "Object-Oriented Programming Fundamentals."
                    ]
                }
            },
            {
                "balta-carrer-dataaccess": {
                    "title": ".NET Data Access",
                    "subtitle": "balta.io Career - 3 courses",
                    "subjects": [
                        "SQL Server Fundamentals;",
                        ".NET C# Data Access with Dapper and SQL Server;",
                        "Entity Framework Fundamentals."
                    ]
                }
            },
            {
                "balta-carrer-aspblazor": {
                    "title": "ASP.NET/Blazor Developer",
                    "subtitle": "balta.io Career - 9 courses",
                    "subjects": [
                        "ASP.NET 6 Fundamentals;",
                        "HTML and CSS Fundamentals;",
                        "Responsive Sites;",
                        "An Overview of ASP.NET Razor Pages;",
                        "..."
                    ]
                }
            },
            {
                "balta-carrer-devops": {
                    "title": "DevOps",
                    "subtitle": "balta.io Career - 1 course",
                    "subjects": [
                        "Azure, Git, GitHub, and DevOps Fundamentals"
                    ]
                }
            },
            {
                "balta-carrer-advanced": {
                    "title": "Advanced .NET Developer",
                    "subtitle": "balta.io Career - 5 courses",
                    "subjects": [
                        "Modeling Rich Domains;",
                        "Refactoring for Unit Tests;",
                        "Applying Object-Oriented Programming in Real Projects with C# 11 and .NET 7;",
                        "Mastering Dependency Injection;",
                        "Security in ASP.NET APIs with JWT and Bearer Authentication."
                    ]
                }
            },
            {
                "others": {
                    "title": "Other Platforms",
                    "subtitle": "",
                    "subjects": [
                        "BC Potencial .NET Developer [96 hours]",
                        "BC Avanade Decola Tech 2024 [73 hours]"
                    ]
                }
            }
        ]
    },
    "portfolio": {
        "title": ": : PORTFOLIO : :",
        "deployButton": "Deployed",
        "sourceButton": "Source code",
        "projects": [
            {
                "vagalivre": {
                    "img": "./images/thumbs/vagalivre.png",
                    "stacks": [
                        "Kotlin",
                        "Jetpack Compose",
                        "Google Maps SDK"
                    ],
                    "name": "Vagalivre Android App",
                    "shortDescription": "Android app developed in Kotlin that provides information about nearby parking lots, prices, and availability of spaces with Google Maps integration.",
                    "longDescription": [
                        "Android app developed in Kotlin that provides information about nearby parking lots, prices, and availability of spaces with Google Maps integration.",
                        "Developed in 2024 during the Analysis and Systems Development course, the app was made in a group and the challenge was to create a simple solution that could consume a web service and provide some benefit in the smart cities scenario.",
                        "<a href=\"https://www.linkedin.com/in/henry-thuler-serbillera/\" target=\"_blank\">Henry Thuler</a>, <a href=\"https://www.linkedin.com/in/bianca-ravani-andrade-a7229ab3/\" target=\"_blank\">Bianca Andrade</a>, and I went above and beyond and created Vagalivre. In addition to using the Google Maps SDK and the Google Places API, we created a backend capable of managing user accounts and applied many architecture and user-experience concepts.",
                        "The full code written in Kotlin with Jetpack Compose is available in the GitHub repository."
                    ],
                    "lastUpdate": "Last update: March/2024",
                    "tag": "MOBILE"
                }
            },
            {
                "maar": {
                    "img": "./images/thumbs/maar.png",
                    "stacks": [
                        "HTML",
                        "CSS",
                        "Javascript",
                        "Readymag"
                    ],
                    "name": "MAAR Website",
                    "shortDescription": "We are a new design company concept. We collaborate with innovative companies to build and grow their brands, thus designing the next era of design together.",
                    "longDescription": [
                        "\"We are a new design company concept. We collaborate with innovative companies to build and grow their brands, thus designing the next era of design together.\"",
                        "I am extremely proud to have been invited to join the development team of this company’s website, which is already born giant.",
                        "Developed using the low-code platform Readymag, my specific responsibility was to program some essential widgets and make adjustments that were not possible only with the drag-and-drop functionality.",
                        "This project was an excellent opportunity to deepen my knowledge in brand design and construction, as well as challenge myself to overcome technical obstacles using HTML, CSS, and JavaScript.",
                        "The final result of this months-long work can be seen by accessing the link beside."
                    ],
                    "lastUpdate": "Last update: April/2024",
                    "tag": "FRONT-END"
                }
            },
            {
                "ethor": {
                    "img": "./images/thumbs/ethor.png",
                    "stacks": [
                        "Kotlin",
                        "Jetpack Compose",
                        "Google AdMob"
                    ],
                    "name": "Ethor Android App",
                    "shortDescription": "Android mobile app that compares prices between ethanol and gasoline, helping users decide which fuel is more economical for their vehicles.",
                    "longDescription": [
                        "Android mobile app that compares prices between ethanol and gasoline, helping users decide which fuel is more economical for their vehicles.",
                        "Through a simple interface, the user enters fuel prices, and the app indicates the best fueling option.",
                        "This project provided a rich experience in using the Kotlin language and Jetpack Compose, a set of tools that allows the creation of user interfaces in a declarative and efficient way.",
                        "The app, which is the first one I published on the Google Play Store, also marks my first experience with advertising integration through Google AdMob."
                    ],
                    "lastUpdate": "Last update: April/2024",
                    "tag": "MOBILE"
                }
            },
            {
                "promoreApi": {
                    "img": "./images/thumbs/promore.png",
                    "stacks": [
                        "C#",
                        ".NET",
                        "SQL Server",
                        "Entity Framework"
                    ],
                    "name": "Promore Web API",
                    "shortDescription": "Rest API developed to integrate the operations of data manipulation and persistence of the Promore software with the Microsoft SQL Server database.",
                    "longDescription": [
                        "Rest API developed to integrate the operations of data manipulation and persistence of the Promore software, used for regularization inspection management by the São Paulo State Engineers Union, with the Microsoft SQL Server database.",
                        "Developed in .NET 8, this API uses abstractions provided by the Entity Framework ORM, incorporating concepts of best coding and architecture practices.",
                        "The source code of the application is available in a public repository on GitHub. To access it, click the \"Repository\" button."
                    ],
                    "lastUpdate": "Last update: July/2024",
                    "tag": "BACK-END"
                }
            },
            {
                "alucar": {
                    "img": "./images/thumbs/alucar.png",
                    "stacks": [
                        "HTML",
                        "CSS",
                        "Tailwind"
                    ],
                    "name": "AluCar Mobile App",
                    "shortDescription": "Project developed during the Analysis and Systems Development course at FIAP for the challenge provided along with BRQ Digital Solutions and the EasyCarros platform.",
                    "longDescription": [
                        "Prototype and coding of the screens of a mobile app developed during the Analysis and Systems Development course at FIAP for the challenge provided along with BRQ Digital Solutions and the EasyCarros platform.",
                        "The work was among the top five in the team, giving us the privilege of presenting it at the <a href=\"https://www.fiap.com.br/next/\" target=\"_blank\">FIAP Next.</a> event.",
                        "Developed throughout 2023 in a group, the software's proposal was to bring to the vehicle rental market a new tool capable of solving some of the current problems faced by this type of service, such as better prices and greater convenience for users when picking up and returning vehicles.",
                        "Special thanks to <a href=\"https://www.linkedin.com/in/henry-thuler-serbillera/\" target=\"_blank\">Henry Thuler</a> and <a href=\"https://www.linkedin.com/in/bianca-ravani-andrade-a7229ab3/\" target=\"_blank\">Bianca Andrade</a> for the partnership."
                    ],
                    "lastUpdate": "Last update: September/2023",
                    "tag": "FRONT-END"
                }
            },
            {
                "profile": {
                    "img": "./images/thumbs/profile.png",
                    "stacks": [
                        "HTML",
                        "CSS",
                        "Javascript",
                        "SwiperJS"
                    ],
                    "name": "Profile Web Page",
                    "shortDescription": "Web project developed to showcase software development work using native HTML, CSS, and JavaScript to create a rich and interactive experience.",
                    "longDescription": [
                        "Web project developed to showcase software development work using native HTML, CSS, and JavaScript to create a rich and interactive experience.",
                        "For someone who developed websites in the early 2000s, when all styles were applied directly in the HTML file, JavaScript was used only for a few simple functionalities, and dynamic visual effects were only possible with technologies like the now-defunct Flash, it is surprising to see how web development has evolved.",
                        "Today, the ability to apply visual effects only with CSS, use semantic tags, and develop more complex programming logic with JavaScript represents a truly disruptive change.",
                        "Over time, I have made several modifications, but I have kept the development as \"vanilla\" as possible, without using frameworks, exploring the native functionalities of the HTML + CSS + JavaScript triad to the fullest, and a single third-party library: SwiperJS."
                    ],
                    "lastUpdate": "Last update: August/2024",
                    "tag": "FRONT-END"
                }
            },
            {
                "fluxusApi": {
                    "img": "./images/thumbs/fluxusapi.png",
                    "stacks": [
                        "Java",
                        "Springboot",
                        "Hibernate",
                        "Flyway"
                    ],
                    "name": "Fluxus Web API V2",
                    "shortDescription": "Rest API developed to integrate the operations of data manipulation and persistence of the Fluxus software with the MySQL.",
                    "longDescription": [
                        "This REST API was developed to integrate the Fluxus software, designed for managing engineering services for professionals accredited by public banks, with an MySQL database. The API allows the manipulation and persistence of essential data, such as professional information, service requests, and invoices.",
                        "In this second version, improvements were implemented focusing on security, organization, scalability, and code cleanliness, aiming to optimize performance and ensure the robustness of the application without impacting the desktop software in production. The changes were designed to minimize rework and facilitate future expansions without compromising the original architecture.",
                        "The API’s source code is available in the GitHub repository, accessible via the link provided."
                    ],
                    "lastUpdate": "Last update: September/2024",
                    "tag": "BACK-END"
                }
            },
            {
                "fluxusApp": {
                    "img": "./images/thumbs/fluxus.png",
                    "stacks": [
                        "C#",
                        ".NET",
                        "Windows Forms",
                        "iTextSharp"
                    ],
                    "name": "Fluxus Windows App",
                    "shortDescription": "Software for managing Work Orders issued by Caixa Econômica Federal to architects and engineers accredited in public tenders.",
                    "longDescription": [
                        "After 15 years away from programming, in 2020, I decided to face a personal challenge: develop software to optimize and automate the process of generating monthly reports required by Caixa Econômica Federal in my work as an architect. This project, which initially seemed simple, turned into a journey of continuous learning and evolution, marking the beginning of the creation of Fluxus, software that would become much more than just a report generator.",
                        "Today, Fluxus is much more than a project to meet a specific need. It has become a living repository of my growth as a developer. Although originally created to generate PDF reports, it now also supports XLS formats and automates data entry. Even without active users, Fluxus continues to evolve, symbolizing my personal and professional journey in programming.",
                        "By clicking <a href=\"https://www.tabnews.com.br/felipeGandra/mas-por-que-eu-mantenho-um-codigo-morto\" target=\"_blank\">here</a>, you can read the article I published on the Tabnews platform about the impact that developing this software had on my career."
                    ],
                    "lastUpdate": "Last update: December/2023",
                    "tag": "DESKTOP"
                }
            },
            {
                "aex30": {
                    "img": "./images/thumbs/aex30.png",
                    "stacks": [
                        "C#",
                        ".NET",
                        "Windows Forms",
                        "NPOI Library"
                    ],
                    "name": "Aex30 Windows App",
                    "shortDescription": "Assistant software to automate the filling of the work progress tracking reports provided by Caixa Econômica Federal.",
                    "longDescription": [
                        "Assistant responsible for automating the process of filling out the Work Progress Tracking Report (RAE) provided by Caixa Econômica Federal, directed to professionals accredited in the service provision tender.",
                        "Based on the service provision call file and the proponent's proposed spreadsheet (PCI), the system facilitates the entire procedure for the service provider.",
                        "With an intuitive interface, the software guides the user step by step, ensuring efficient and accurate filling. At the end of the process, the system generates the RAE spreadsheet with all the header data, percentages per item, physical-financial schedule, and necessary contractual information. The only remaining task for the user is to fill in the survey results."
                    ],
                    "lastUpdate": "Last update: April/2023",
                    "tag": "DESKTOP"
                }
            },
            {
                "money": {
                    "img": "./assets/images/thumbs/money.png",
                    "stacks": [
                        "Kotlin",
                        "Compose Desktop",
                        "Hibernate",
                        "Flyway"
                    ],
                    "name": "Money Desktop App",
                    "shortDescription": "Multi-platform desktop software for personal finance management. Keep track of bank transactions, credit cards, accounts payable, and accounts receivable.",
                    "longDescription": [
                        "Developed in Kotlin, using the Compose Multiplatform framework, Money (temporary name) is a multi-platform personal finance management software designed to be an open-source alternative for users of Windows, MacOS, and Linux operating systems.",
                        "Licensed under the OpenSource MIT license, with a clean, intuitive interface and no advertisements, the application is still in its early development stages and is expected to receive many features and refinements, both in design and code, over the coming months.",
                        "More information coming soon."
                    ],
                    "lastUpdate": "Last update: November/2024",
                    "tag": "DESKTOP"
                }
            }
        ]
    },
    "footer": {
        "resume": {
            "title": "Resume",
            "description": "Resume (en-us)",
            "link": "https://drive.google.com/file/d/15HvtpmEJhm2zOV01VaXSBkW5pguIOyc4/view?usp=sharing"
        },
        "links": {
            "title": "Links",
            "moreAboutMe": "→ Learn more",
            "courses": "→ Courses"
        },
        "contacts": {
            "title": "Contacts",
            "email": "fgandraf@gmail.com",
            "phone": "(14) 99829-0103",
            "github": "github.com/fgandraf",
            "linkedin": "linkedin.com/in/fgandraf"
        }
    }
}